{
  "title": "Pourquoi le rachat de GitHub par Microsoft pour 7,5 milliards de dollars choque Internet",
  "author": "Sylvain Rolland",
  "hostname": "latribune.fr",
  "date": "2018-06-05",
  "fingerprint": "20742f161edcca57",
  "id": null,
  "license": null,
  "comments": "",
  "text": "Why the redemption of GitHub by Microsoft for $ 7.5 billion shocks Internet.Microsoft invests $ 30 million over three years in France. Brian Snyder.Microsoft invests $ 30 million over three years in France.brian Snyder. Minute. 16: 43.15: 54.15: 00.14: 45.14: 16.13: 20.10: 20.9: 16.8: 45.8: 00.7: 56.7: 05.6: 00.6: 00.5: 30.4: 00.16: 54.15: 48.15: 37. See all dispatches. world of software, and in particular free and open software. Github, the reference platform for developers around the world, was bought by the American net giant Microsoft, known for its software suite -Forée- Windows. After several days of rumors, the Redmond firm confirmed the acquisition, for an amount of $ 7.5 billion (6.4 billion euros). The transaction must be carried out by Microsoft actions and should be finalized at the end of the year after the green light from the regulatory authorities. Created in 2008, Github is certainly not very well known to the general public, but it still claims more than 28 million users worldwide. Bible of developers, it is a platform that allows them to publish and share, in a completely open way if they wish, the code they have created. Github is now hosting more than 80 million projects: software of course, but also any other computer program (site, mobile application), without limitation of programming language. Opening and the spirit of sharing that reigns in its community of users have logically transformed Github into one of the flagship platforms of supporters of free software. The latter promote the transparency of software thanks to the publication of the entire source code, which allows anyone to have access to it, to be able to modify it to enrich it, or to use certain parts to create another software. With free software, a user can for example adapt the program to the use he makes of it, which offers him flexibility. Free software is also supported by defenders of freedoms on the net because its transparency is deemed democratic -Chacun can understand the actions and decisions of the program -. It is also considered to be safer, because developers can identify if the code has been altered by a stolen door - a flaw used in particular by intelligence services - or a cybercriminal. So, the culture of free claims transparency, sharing and often free. It is opposed with most players in the software industry, who create and market owner or closed software, that is to say, the source code of which is kept secret to prevent us from copying or modifying it. Microsoft, the third world market capitalization behind Apple and Amazon, is the largest symbol with its owner suite Windows, which has made its richness. The announcing of Github's buyout by Microsoft therefore gives some cold sweats in the world of free software, both disappointed and worried. His supporters fear that the giant of Redmond does not distort the concept of Github, in particular his collaborative approach, that he locks his flexibility of use or that he is trying to take advantage of it. In a press release, Microsoft wanted to be reassuring. For the American company, the acquisition will allow developers to have new tools at each stage of software development, which will allow them to provide new services to their users:\nShould we see in this redemption the destruction of a symbol of free software, or on the contrary its recognition by one of the major players in the software industry? In recent years, Satya Nadella, the CEO of Microsoft, has been changing the group to the cloud and artificial intelligence, and has multiplied the statements favorable to the development of free software. Even if Windows and the services in the cloud -Logiciales and accommodation - draw most of the group's income, Microsoft has thus started a rapprochement to the culture of free software. It offers for example the operating system open Linux. To read also. The most read projects.",
  "language": "fr",
  "image": "https://pictures.latribune.fr/cdn-cgi/image/format=auto,width=1200,height=675/721/956721.jpg",
  "pagetype": "article",
  "filedate": "2025-08-21",
  "source": "https://www.latribune.fr/technos-medias/internet/pourquoi-le-rachat-de-github-par-microsoft-pour-7-5-milliards-de-dollars-choque-internet-780682.html?id=254129919696714",
  "source-hostname": "La Tribune",
  "excerpt": "Microsoft a officialisé le rachat, pour un montant de 7,5 milliards de dollars, de la plateforme de création de logiciels GitHub. Tollé sur le web : GitHub est l'un des sites phares des partisans du logiciel libre, qui s'opposent aux entreprises qui diffusent des logiciels fermés ou propriétaires, dont Microsoft est l'un des porte-étendards.",
  "categories": "Technos & Medias;Internet",
  "tags": "",
  "text_orig": "Pourquoi le rachat de GitHub par Microsoft pour 7,5 milliards de dollars choque Internet\nMicrosoft investit 30 millions de dollars sur trois ans en france\nBrian Snyder\nMicrosoft investit 30 millions de dollars sur trois ans en france\nBrian Snyder\nDERNIÈRE MINUTE\n16:43\n15:54\n15:00\n14:45\n14:16\n13:20\n10:20\n9:16\n8:45\n8:00\n7:56\n7:05\n6:00\n6:00\n5:30\n4:00\n16:54\n15:48\n15:31\n15:27\nVoir toutes les dépêches\nSéisme dans le monde du logiciel, et notamment du logiciel libre et ouvert. GitHub, la plateforme de référence des développeurs du monde entier, a été rachetée par le géant du Net américain Microsoft, connu pour sa suite logicielle -fermée- Windows. Après plusieurs jours de rumeurs, la firme de Redmond a confirmé le rachat, pour un montant de 7,5 milliards de dollars (6,4 milliards d'euros). La transaction doit s'effectuer par des actions Microsoft et devrait être finalisée en fin d'année après le feu vert des autorités réglementaires.\nCréée en 2008, GitHub n'est certes pas très connu du grand public, mais il revendique tout de même plus de 28 millions d'utilisateurs dans le monde. Bible des développeurs, il s'agit d'une plateforme qui leur permet de publier et de partager, de manière totalement ouverte s'ils le souhaitent, le code qu'ils ont créé. GitHub héberge aujourd'hui plus de 80 millions de projets : des logiciels bien sûr, mais aussi n'importe quel autre programme informatique (site, application mobile), sans limitation de langage de programmation.\nSon ouverture et l'esprit de partage qui règne dans sa communauté d'utilisateurs ont logiquement transformé GitHub en l'une des plateformes phares des partisans du logiciel libre. Ces derniers promeuvent la transparence des logiciels grâce à la publication de l'entièreté du code source, ce qui permet à n'importe qui d'y avoir accès, de pouvoir le modifier pour l'enrichir, ou d'en utiliser certaines parties pour créer un autre logiciel. Avec un logiciel libre, un utilisateur peut par exemple adapter le programme à l'utilisation qu'il en fait, ce qui lui offre de la souplesse. Le logiciel libre est également soutenu par les défenseurs des libertés sur le Net car sa transparence est jugée démocratique -chacun peut comprendre les actions et décisions du programme-. Il est aussi considéré comme plus sûr, car les développeurs peuvent repérer si le code a été altéré par une porte dérobée -une faille utilisée notamment par les services de renseignement- ou un cybercriminel.\nAinsi, la culture du libre revendique des valeurs de transparence, de partage et souvent de gratuité. Elle s'oppose avec la plupart des acteurs de l'industrie du logiciel, qui créent et commercialisent des logiciels propriétaires ou fermés, c'est-à-dire dont le code source est gardé secret pour éviter qu'on puisse le copier ou le modifier. Microsoft, troisième capitalisation boursière mondiale derrière Apple et Amazon, en est le plus grand symbole avec sa suite propriétaire Windows, qui a fait sa richesse.\nL'annonce du rachat de GitHub par Microsoft donne donc quelques sueurs froides au monde du logiciel libre, à la fois déçu et inquiet. Ses partisans redoutent que le géant de Redmond ne dénature le concept de GitHub, notamment son approche collaborative, qu'il verrouille sa souplesse d'utilisation ou qu'il cherche à en tirer profit.\nDans un communiqué, Microsoft s'est voulu rassurant. Pour l'entreprise américaine, l'acquisition va permettre aux développeurs de disposer de nouveaux outils à chaque étape de développement d'un logiciel, ce qui leur permettra de fournir de nouveaux services à leurs utilisateurs:\nFaut-il voir dans ce rachat la destruction d'un symbole du logiciel libre, ou au contraire sa reconnaissance par l'un des acteurs majeurs de l'industrie du logiciel ? Depuis quelques années, Satya Nadella, le Pdg de Microsoft, effectue une mutation du groupe vers le cloud et l'intelligence artificielle, et a multiplié les déclarations favorables au développement du logiciel libre. Même si Windows et les services dans le cloud -logiciels et hébergement- tirent l'essentiel des revenus du groupe, Microsoft a ainsi amorcé un rapprochement vers la culture du logiciel libre. Il propose par exemple le système d'exploitation ouvert Linux.\nÀ lire également\nSujets les plus lus"
}